---
kind: method
id: M:Autodesk.Revit.DB.PDFExportOptions.GetNamingRule
source: html/34fea483-aaa2-6762-a622-57fdc324499f.htm
---
# Autodesk.Revit.DB.PDFExportOptions.GetNamingRule Method

Gets a copy of the naming rule.

## Syntax (C#)
```csharp
public IList<TableCellCombinedParameterData> GetNamingRule()
```

## Returns
The naming rule.